storage/app/step83-load-results/20260517-235031/smoke_life_balance_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/life-balance/summary
Document Length:        649 bytes

Concurrency Level:      5
Time taken for tests:   0.543 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      48898 bytes
HTML transferred:       32450 bytes
Requests per second:    92.10 [#/sec] (mean)
Time per request:       54.287 [ms] (mean)
Time per request:       10.857 [ms] (mean, across all concurrent requests)
Transfer rate:          87.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:    27   46  15.2     46      82
Waiting:       27   46  15.1     45      82
Total:         27   47  15.2     46      82

Percentage of the requests served within a certain time (ms)
  50%     46
  66%     53
  75%     56
  80%     59
  90%     72
  95%     76
  98%     82
  99%     82
 100%     82 (longest request)