storage/app/step83-load-results/20260517-235031/smoke_projects_index.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/projects
Document Length:        594 bytes

Concurrency Level:      5
Time taken for tests:   0.476 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      46151 bytes
HTML transferred:       29700 bytes
Requests per second:    105.02 [#/sec] (mean)
Time per request:       47.611 [ms] (mean)
Time per request:       9.522 [ms] (mean, across all concurrent requests)
Transfer rate:          94.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    22   45   9.1     43      69
Waiting:       22   44   9.1     43      68
Total:         22   45   9.1     43      69

Percentage of the requests served within a certain time (ms)
  50%     43
  66%     48
  75%     50
  80%     53
  90%     58
  95%     59
  98%     69
  99%     69
 100%     69 (longest request)