storage/app/step83-load-results/20260517-235031/stress_ai_recommendations.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/ai/recommendations
Document Length:        199 bytes

Concurrency Level:      50
Time taken for tests:   5.645 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      264048 bytes
HTML transferred:       99500 bytes
Requests per second:    88.57 [#/sec] (mean)
Time per request:       564.534 [ms] (mean)
Time per request:       11.291 [ms] (mean, across all concurrent requests)
Transfer rate:          45.68 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.3      0      12
Processing:    42  530 103.1    539     658
Waiting:       38  530 103.3    539     658
Total:         53  531 101.8    540     658

Percentage of the requests served within a certain time (ms)
  50%    540
  66%    558
  75%    583
  80%    598
  90%    621
  95%    629
  98%    638
  99%    648
 100%    658 (longest request)