storage/app/step83-load-results/20260517-235031/stress_dashboard_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/dashboard/summary
Document Length:        692 bytes

Concurrency Level:      50
Time taken for tests:   7.129 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      510521 bytes
HTML transferred:       346000 bytes
Requests per second:    70.13 [#/sec] (mean)
Time per request:       712.950 [ms] (mean)
Time per request:       14.259 [ms] (mean, across all concurrent requests)
Transfer rate:          69.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.0      0       8
Processing:    54  671 130.8    692     925
Waiting:       46  670 130.7    691     925
Total:         54  671 129.6    692     925

Percentage of the requests served within a certain time (ms)
  50%    692
  66%    722
  75%    736
  80%    750
  90%    805
  95%    843
  98%    897
  99%    905
 100%    925 (longest request)