storage/app/step83-load-results/20260517-235031/stress_finance_transactions.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/finance/transactions
Document Length:        80 bytes

Concurrency Level:      50
Time taken for tests:   4.396 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      204484 bytes
HTML transferred:       40000 bytes
Requests per second:    113.74 [#/sec] (mean)
Time per request:       439.615 [ms] (mean)
Time per request:       8.792 [ms] (mean, across all concurrent requests)
Transfer rate:          45.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0      13
Processing:     0  497 160.9    538     672
Waiting:        0  497 160.8    538     672
Total:          0  498 160.6    540     672

Percentage of the requests served within a certain time (ms)
  50%    540
  66%    580
  75%    592
  80%    600
  90%    609
  95%    618
  98%    629
  99%    644
 100%    672 (longest request)