storage/app/step83-load-results/20260517-235031/stress_life_balance_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/life-balance/summary
Document Length:        649 bytes

Concurrency Level:      50
Time taken for tests:   7.295 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      489010 bytes
HTML transferred:       324500 bytes
Requests per second:    68.54 [#/sec] (mean)
Time per request:       729.479 [ms] (mean)
Time per request:       14.590 [ms] (mean, across all concurrent requests)
Transfer rate:          65.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       4
Processing:    53  677 181.4    655    1120
Waiting:       53  676 181.3    654    1120
Total:         55  677 181.1    655    1120

Percentage of the requests served within a certain time (ms)
  50%    655
  66%    701
  75%    750
  80%    772
  90%    938
  95%   1081
  98%   1101
  99%   1113
 100%   1120 (longest request)