storage/app/step83-load-results/20260517-235031/stress_projects_index.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/projects
Document Length:        594 bytes

Concurrency Level:      50
Time taken for tests:   5.570 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      461512 bytes
HTML transferred:       297000 bytes
Requests per second:    89.77 [#/sec] (mean)
Time per request:       557.002 [ms] (mean)
Time per request:       11.140 [ms] (mean, across all concurrent requests)
Transfer rate:          80.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       4
Processing:    34  530 107.0    540     704
Waiting:       32  530 107.1    540     704
Total:         34  530 106.4    540     704

Percentage of the requests served within a certain time (ms)
  50%    540
  66%    559
  75%    572
  80%    600
  90%    637
  95%    651
  98%    668
  99%    670
 100%    704 (longest request)